___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [1]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [2]:
df = pd.DataFrame(data)

In [3]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [39]:
#before groupby
df.count()# it counts rows'count of each col

Company    6
Person     6
Sales      6
dtype: int64

In [4]:
df.groupby('Company')# we should define a new variable

You can save this object as a new variable:

In [34]:
by_comp = df.groupby("Company")# there is nothing to show. just we can use aggregate methods

In [35]:
type(by_comp)

pandas.core.groupby.generic.DataFrameGroupBy

And then call aggregate methods off the object:

In [41]:
#After groupby
by_comp.count()# it counts rows'count of each col in each group.
#compare with before groupby

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [36]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [37]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

More examples of aggregate methods:

In [38]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [39]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [8]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [42]:
by_comp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [44]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [43]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [44]:
by_comp.describe().transpose()['GOOG']

       count   mean        std    min    25%    50%    75%    max
Sales    2.0  160.0  56.568542  120.0  140.0  160.0  180.0  200.0

In [21]:
by_comp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [22]:
by_comp.sum().loc[['FB','GOOG']]

         Sales
Company
FB         593
GOOG       320

In [23]:
by_comp.get_group('FB')

  Person  Sales
4   Carl    243
5  Sarah    350

In [45]:
by_cp= df.groupby(["Company","Person"])

In [46]:
by_cp.sum()

                 Sales
Company Person
FB      Carl       243
        Sarah      350
GOOG    Charlie    120
        Sam        200
MSFT    Amy        340
        Vanessa    124